soap

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:tns="http://anomatver.xyz/soa3">
    <soapenv:Header/>
    <soapenv:Body>
        <tns:GetByGenreRequest>
            <genre>HIP_HOP</genre>
        </tns:GetByGenreRequest>
    </soapenv:Body>
</soapenv:Envelope>
